why-i-made-the-growing-wiki.org
#+title: Why I made the Growing Wiki
#+date: [2025-12-27 Sat 15:53]
#+HUGO_BASE_DIR: /home/james/wiki/.site
#+HUGO_SECTION: 
#+HUGO_DRAFT: false
#+HUGO_DATE: 2025-12-27
#+EXPORT_FILE_NAME: why-i-made-the-growing-wiki

* TODO Content
:PROPERTIES:
:ID:       20251227T155317.169024
:END:

Because why not?

On a serious note, I find myself to be a very forgetful person. So to retain the content I consume, ideas that sparked and notes that I plan on re-visiting; I have longed for a place to store, curate and recall everything.

I also find it super helpful to "grow" and "cultivate" my thoughts and ideas when trying to share it with a friend.
It's very reminiscent of the [[id:20251215T161102.986249][rubberducking method]]. But instead of talking to a rubber duck, I choose to scream into the void of internet, to you.

As for why doing it this way, instead of x ... and more, find out [[id:20251215T151413.540793][here]].

