.site/content/why-i-made-the-growing-wiki.md
+++
title = "Why I made the Growing Wiki"
author = ["James"]
date = 2025-12-27T15:53:00+00:00
draft = false
+++

## <span class="org-todo todo TODO">TODO</span> Content {#content}

Because why not?

On a serious note, I find myself to be a very forgetful person. So to retain the content I consume, ideas that sparked and notes that I plan on re-visiting; I have longed for a place to store, curate and recall everything.

I also find it super helpful to "grow" and "cultivate" my thoughts and ideas when trying to share it with a friend.
It's very reminiscent of the [rubberducking method](/rubber-duck-debugging/#content). But instead of talking to a rubber duck, I choose to scream into the void of internet, to you.

As for why doing it this way, instead of x ... and more, find out [here](/why-growing-wiki/#content).
